/******************************************************************************************************
* Copyright (c) 2010,深圳市麦格斯科技有限公司软件部
* All rights reserved.
*
* 文件名称  ：CirclueBuffer.h
* 摘要      ：循环队列的头文件
*
* Current Version 1.0--xiefuwei--2011.09.16
* 描述： Create This file
*        循环队列的操作接口，包括写数据，读数据，清空数据等等
*
*******************************************************************************************************
*/
#ifndef _CIRCLEBUFFER_H_
#define _CIRCLEBUFFER_H_

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*循环队列的最大个数,最大存储2帧的消息数据*/
//#define MAX_BUFFER_SIZE         30
#define MAX_BUFFER_SIZE         36

/*循环缓冲区的定义*/
typedef struct CIRCLE_BUFF_s
{
    /* 动态属性 */
    unsigned char ucWrId;           /*写位置的索引*/
    unsigned char ucReId;           /*读位置的索引*/
    unsigned char ucCurrLen;        /*缓冲区数据计数器*/

    /* 静态属性 */
    unsigned char aucBuffer[MAX_BUFFER_SIZE]; /*数据缓冲区*/
        
}CIRCLE_BUFF_T;
/******************************************************************************************************
*
* 函数介绍：    CircularBufInit --初始化循环队列
* 输入参数说明：pstBuffer       --要初始化的队列指针
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char CircularBufInit(CIRCLE_BUFF_T* pstBuffer);

/******************************************************************************************************
*
* 函数介绍：    getCircularbufCursize --获取循环队列的已使用空间长度
* 输入参数说明：pCBHandle             --队列指针
* 输出参数说明：无
* 返回值：      成功返回长度,失败返回 0
*******************************************************************************************************
*/
unsigned char GetCircularbufCursize(CIRCLE_BUFF_T *pCBHandle);

/******************************************************************************************************
*
* 函数介绍：    resetCircularBuf --重置一个循环队列
* 输入参数说明：pCBHandle        --队列指针
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char ResetCircularBuf(CIRCLE_BUFF_T *pCBHandle);

/******************************************************************************************************
*
* 函数介绍：    writeCircularBufZero --将队列的某一段数据写0
* 输入参数说明：pCBHandle            --队列指针
*               Length               --要写的长度
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char WriteCircularBufZero(CIRCLE_BUFF_T *pCBHandle, unsigned char ucLength);

/******************************************************************************************************
*
* 函数介绍：    writeCircularBuf --将队列的某一段数据写入队列
* 输入参数说明：pCBHandle        --队列指针
*               pData            --要写的数据
*               Length           --要写的长度
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char WriteCircularBuf(CIRCLE_BUFF_T *pCBHandle, unsigned char *pData, unsigned char ucLength);

/******************************************************************************************************
*
* 函数介绍：    readCircularBuf --从队列读出某段数据，并且删除队列的该段数据
* 输入参数说明：pCBHandle       --队列指针
*               pData           --要读出来的数据
*               Length          --要读的长度
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char ReadCircularBuf(CIRCLE_BUFF_T *pCBHandle, unsigned char *pData, unsigned char *pLength);

/******************************************************************************************************
*
* 函数介绍：    getCircularBuf  --从队列读出某段数据，但是不删除队列的该段数据
* 输入参数说明：pCBHandle       --队列指针
*               pData           --要读出来的数据
*               Length          --要读的长度
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char GetCircularBuf(CIRCLE_BUFF_T *pCBHandle, unsigned char *pData, unsigned char *pLength);

/******************************************************************************************************
*
* 函数介绍：    releaseCircularBuf  --要将队列的某段数据清空掉
* 输入参数说明：pCBHandle           --队列指针
*               Length              --要清空的长度
* 输出参数说明：无
* 返回值：      成功返回0,失败返回-1
*******************************************************************************************************
*/
char ReleaseCircularBuf(CIRCLE_BUFF_T *pCBHandle, unsigned char *pLength);

#endif

