/*******************************************************************************************************
* Copyright (c) 2010,深圳市麦格斯科技有限公司终端部
* All rights reserved.
*
* 文件名称  : memory.h
* 摘要      : 内存分配的测试函数
*
* Current Version 1.0--wuwei--2012.08.17
* 描述：创建文件
*******************************************************************************************************
*/



#ifndef MEMORY_H
#define MEMORY_H

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*指针没有指向一个合法的内存*/
#if 0
struct student
{
	char *name;
	int score;
}stu,*pstu;
#endif

/* 没有为指针分配内存的例程 */
char PmemoryTest(void);

/* 为指针分配内存测试函数 */
char Pmalloc(void);

void ResFun(int i);

void memory(void);

/***********************************************************************************************************
函数返回值得问题

***********************************************************************************************************/

char *GetStr(void);

int GetVal(void);





#endif